<a href="https://colab.research.google.com/github/TMPenwell/MIS2800/blob/main/MIS2800_IC1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('mis2800_practice.db')

In [3]:
conn execute(""" CREATE TABLE students(
    student_id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    grade INTEGER
)
))

SyntaxError: unterminated triple-quoted string literal (detected at line 7) (ipython-input-2013290197.py, line 1)

In [4]:
conn execute("""
CREATE TABLE students (
  student_id INTEGER PRIMARY KEY,
  first_name TEXT,
  last_name TEXT,
  gpa REAL
  ) STRICT;
  """
)

SyntaxError: invalid syntax (ipython-input-2233384174.py, line 1)

In [5]:
conn.execute("""
CREATE TABLE students (
  student_id INTEGER PRIMARY KEY,
  first_name TEXT,
  last_name TEXT,
  gpa REAL
  ) STRICT;
  """
)

In [6]:
conn.execute("""
INSERT INTO students (name, gpa)
VALUES ('Alic', 3.8),
      ('Bob', 3.2),
      ('Charlie', 3.9);
      """)

OperationalError: table students has no column named name

In [7]:
conn.execute ("""
INSERT INTO students (first_name, last_name, gpa)
VALUES ('Taylor', 'Swift', 3.5),
  ('Joe', 'Burrow', 3.8),
  ('Joe', 'Falco', 3.9);
  """)

In [8]:
conn.execute("""SELECT * FROM students""")

SyntaxError: invalid syntax. Perhaps you forgot a comma? (ipython-input-206492156.py, line 1)

In [9]:
conn.execute("""SELECT * FROM students""")

In [10]:
cursor = conn.execute("""SELECT * FROM students""")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Taylor', 'Swift', 3.5)
(2, 'Joe', 'Burrow', 3.8)
(3, 'Joe', 'Falco', 3.9)